Revit 2027 API
FabricationServiceButton.GetConditionImage Method
Gets the image for the specified fabrication service button condition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Bitmap GetConditionImage(
	int condition
)
Public Overridable Function GetConditionImage (
	condition As Integer
) As Bitmap
public:
virtual Bitmap^ GetConditionImage(
	int condition
)
abstract GetConditionImage :
        condition : int -> Bitmap
override GetConditionImage :
        condition : int -> Bitmap
Parameters
condition Int32
The condition index.
Return Value
Bitmap
System.Drawing.Bitmap represents the fabrication service button image. null if there is no preview image.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the index condition is not larger or equal to 0 and less than ConditionCount
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace